
# CTRL+ALT+T - команда открытия терминала  
 
# ~ - символ домашней директории 
# / - символ корневой директории

# .. - обозначают предыдущую директорию
# . - обозначает текущую директорию

# . перед файлом делает ее скрытой
  
#  1. ls(list) - выводит список всех папок (директорий) и файлов в текущей рабочей директории
 
#  2. cd(change directory) -> меняет текущую директорию (папоку) на указанную
#  (cd <название директории>)
 
#  3. touch -> создает указанный файл (touch <name_of_file>)
 
#  4. pwd (present working directory) -> выводит путь до текущей директории(папка)
 
#  5. mkdir(make directory) -> создает указанную директорию 
 
#  6. rmdir(remove directory) -> удаляет указанную директорию
 
#  7. rm -rf (remove -remove force) -> принудительное удаление
 
#  8. rm (remove) -> удаление файлов 
 
#  9. ls -a ->  выводит список как скрытых так и обычных директорий и файлов
 
#  10. nano <path_to_file> -> открывает графический интерфейс для редоктирования файла / *если нет указанного файла, то создаться новый файл с таким именем
 
#  11. cat <path_to_file> -> выводит содержимое файла
 
#  12. mv (move or rename files)
 
#  13. cp from to
 
#  14. du (disk usage) <name_of_title>
 
#  15. ping <site_link>
#  ctrl+c for stop
 
#  16. gnome_system_monitor  -  открывает диспетчер задач (task manager) 
 
#  17. && - команды одной строкой
 
#  18. mv <file> ../dir
 
#  19.
 
 
 
#  mv test.txt ../week2
 
 
 
 
 
